MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NANO110SD3BN/mcu.h
#define CLK_PLLCTL_IN_DV_Pos             (8)                                               /*!< CLK_T::PLLCTL: IN_DV Position             */
#define CLK_PLLCTL_IN_DV_Msk             (0x3ul << CLK_PLLCTL_IN_DV_Pos)                   /*!< CLK_T::PLLCTL: IN_DV Mask                 */

#define CLK_PLLCTL_OUT_DV_Pos            (12)                                              /*!< CLK_T::PLLCTL: OUT_DV Position            */
#define CLK_PLLCTL_OUT_DV_Msk            (0x1ul << CLK_PLLCTL_OUT_DV_Pos)                  /*!< CLK_T::PLLCTL: OUT_DV Mask                */

#define CLK_PLLCTL_PD_Pos                (16)                                              /*!< CLK_T::PLLCTL: PD Position                */
#define CLK_PLLCTL_PD_Msk                (0x1ul << CLK_PLLCTL_PD_Pos)                      /*!< CLK_T::PLLCTL: PD Mask                    */

#define CLK_PLLCTL_PLL_SRC_Pos           (17)                                              /*!< CLK_T::PLLCTL: PLL_SRC Position           */
#define CLK_PLLCTL_PLL_SRC_Msk           (0x1ul << CLK_PLLCTL_PLL_SRC_Pos)                 /*!< CLK_T::PLLCTL: PLL_SRC Mask               */

#define CLK_FRQDIV_FSEL_Pos              (0)                                               /*!< CLK_T::FRQDIV: FSEL Position              */
#define CLK_FRQDIV_FSEL_Msk              (0xful << CLK_FRQDIV_FSEL_Pos)                    /*!< CLK_T::FRQDIV: FSEL Mask                  */

#define CLK_FRQDIV_FDIV_EN_Pos           (4)                                               /*!< CLK_T::FRQDIV: FDIV_EN Position           */
#define CLK_FRQDIV_FDIV_EN_Msk           (0x1ul << CLK_FRQDIV_FDIV_EN_Pos)                 /*!< CLK_T::FRQDIV: FDIV_EN Mask               */

#define CLK_MCLKO_MCLK_SEL_Pos           (0)                                               /*!< CLK_T::MCLKO: MCLK_SEL Position           */
#define CLK_MCLKO_MCLK_SEL_Msk           (0x3ful << CLK_MCLKO_MCLK_SEL_Pos)                /*!< CLK_T::MCLKO: MCLK_SEL Mask               */

#define CLK_MCLKO_MCLK_EN_Pos            (7)                                               /*!< CLK_T::MCLKO: MCLK_EN Position            */
#define CLK_MCLKO_MCLK_EN_Msk            (0x1ul << CLK_MCLKO_MCLK_EN_Pos)                  /*!< CLK_T::MCLKO: MCLK_EN Mask                */

#define CLK_WK_INTSTS_PD_WK_IS_Pos       (0)                                               /*!< CLK_T::WK_INTSTS: PD_WK_IS Position          */
#define CLK_WK_INTSTS_PD_WK_IS_Msk       (0x1ul << CLK_WK_INTSTS_PD_WK_IS_Pos)             /*!< CLK_T::WK_INTSTS: PD_WK_IS Mask              */

/**@}*/ /* CLK_CONST */
/**@}*/ /* end of CLK register group */


/*---------------------- Digital to Analog Converter -------------------------*/
/**
    @addtogroup DAC Digital to Analog Converter(DAC)
    Memory Mapped Structure for DAC Controller
@{ */

typedef struct
{


    /**
     * CTL0
     * ===================================================================================================
     * Offset: 0x00  DAC0 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |DACEN     |DAC Enable
     * |        |          |0 = Power down DAC.
     * |        |          |1 = Power on DAC.
     * |        |          |Note: When DAC is powered on, DAC will automatically start conversion after waiting for DACPWONSTBCNT+1 PCLK cycle
     * |[1]     |DACIE     |DAC Interrupt Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[6:4]   |DACLSEL   |DAC Load Selection
     * |        |          |Select the load trigger for the DAC latch.
     * |        |          |000 = DAC latch loads when DACx_DAT written
     * |        |          |001 = PDMA ACK
     * |        |          |010 = Rising edge of TMR0
     * |        |          |011 = Rising edge of TMR1
     * |        |          |100 = Rising edge of TMR2
     * |        |          |101 = Rising edge of TMR3
     * |        |          |Others = Reserved
     * |[21:8]  |DACPWONSTBCNT|DACPWONSTBCNT
     * |        |          |DAC need 6 us to be stable after DAC is power on from power down state.
     * |        |          |This field controls a internal counter (in PCLK unit) to guarantee DAC stable time requirement.
    */
    __IO uint32_t CTL0;

    /**
     * DATA0
     * ===================================================================================================
     * Offset: 0x04  DAC0 Data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[11:0]  |DACData   |DAC data
    */
    __IO uint32_t DATA0;

    /**
     * STS0
     * ===================================================================================================
     * Offset: 0x08  DAC0 Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |DACIFG    |DAC Interrupt Flag
     * |        |          |0 = No interrupt pending.
     * |        |          |1 = Interrupt pending.
     * |        |          |Note: This bit is read only.
     * |[1]     |DACSTFG   |DAC Start Flag
     * |        |          |0 = DAC is not start yet.
     * |        |          |1 = DAC has been started.
     * |        |          |Note: this bit is read only.
     * |[2]     |BUSY      |BUSY Bit
     * |        |          |0 = DAC is not busy.
     * |        |          |1 = DAC is busy.
    */
    __IO uint32_t STS0;
    uint32_t RESERVE0[1];


    /**
     * CTL1
     * ===================================================================================================
     * Offset: 0x10  DAC1 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |DACEN     |DAC Enable
     * |        |          |0 = Power down DAC.
     * |        |          |1 = Power on DAC.
     * |        |          |Note: When DAC is powered on, DAC will automatically start conversion after waiting for DACPWONSTBCNT+1 PCLK cycle
     * |[1]     |DACIE     |DAC Interrupt Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[6:4]   |DACLSEL   |DAC Load Selection
     * |        |          |Select the load trigger for the DAC latch.
     * |        |          |000 = DAC latch loads when DACx_DAT written
     * |        |          |001 = PDMA ACK
     * |        |          |010 = Rising edge of TMR0
     * |        |          |011 = Rising edge of TMR1
     * |        |          |100 = Rising edge of TMR2
     * |        |          |101 = Rising edge of TMR3
     * |        |          |Others = Reserved
     * |[21:8]  |DACPWONSTBCNT|DACPWONSTBCNT
     * |        |          |DAC need 6 us to be stable after DAC is power on from power down state.
     * |        |          |This field controls a internal counter (in PCLK unit) to guarantee DAC stable time requirement.
    */
    __IO uint32_t CTL1;

    /**
     * DATA1
     * ===================================================================================================
     * Offset: 0x14  DAC1 Data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[11:0]  |DACData   |DAC data
    */
    __IO uint32_t DATA1;

    /**
     * STS1
     * ===================================================================================================
     * Offset: 0x18  DAC1 Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |DACIFG    |DAC Interrupt Flag
     * |        |          |0 = No interrupt pending.
     * |        |          |1 = Interrupt pending.
     * |        |          |Note: This bit is read only.
     * |[1]     |DACSTFG   |DAC Start Flag
     * |        |          |0 = DAC is not start yet.
     * |        |          |1 = DAC has been started.
     * |        |          |Note: this bit is read only.
     * |[2]     |BUSY      |BUSY Bit
     * |        |          |0 = DAC is not busy.
     * |        |          |1 = DAC is busy.
    */
    __IO uint32_t STS1;
    uint32_t RESERVE1[1];


    /**
     * COMCTL
     * ===================================================================================================
     * Offset: 0x20  DAC01 Common Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |WAITDACCONV|Wait DAC Conversion Complete
     * |        |          |The DAC needs at least 2 us to settle down every time when each data deliver to DAC, which means user cannot update each DACx_data register faster than 2 us; otherwise data will lost.
     * |        |          |Setting this register can adjust the time interval in PCLK unit between each DACx_data into DAC in order to meet the 2 us requirement.
     * |[8]     |DAC01GRP  |Group DAC0 And DAC1
     * |        |          |0 = Not grouped.
     * |        |          |1 = Grouped.
     * |[10:9]  |REFSEL    |Reference Voltage Selection
     * |        |          |00 = AVDD
     * |        |          |01 = Internal reference voltage
     * |        |          |10 = External reference voltage
     * |        |          |11= Reserved
    */
    __IO uint32_t COMCTL;

} DAC_T;

/**
    @addtogroup DAC_CONST DAC Bit Field Definition
    Constant Definitions for DAC Controller
@{ */

#define DAC_CTL_DACEN_Pos                (0)                                               /*!< DAC_T::CTL: DACEN Position                */
#define DAC_CTL_DACEN_Msk                (0x1ul << DAC_CTL_DACEN_Pos)                      /*!< DAC_T::CTL: DACEN Mask                    */

#define DAC_CTL_DACIE_Pos                (1)                                               /*!< DAC_T::CTL: DACIE Position                */
#define DAC_CTL_DACIE_Msk                (0x1ul << DAC_CTL_DACIE_Pos)                      /*!< DAC_T::CTL: DACIE Mask                    */

